In [2]:
# 데이터 분석에 사용되는 표준라이브러리 로딩작업
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
# import matplotlib as mpl

In [3]:
# 1차원 배열 : 시리즈(Series) = 값(values)과 인덱스(index)
#sr = pd.Series(data, index, columns)
sr = pd.Series([17000, 18000, 1000, 5000], index=['피자', '치킨', '콜라', '맥주'])
sr

피자    17000
치킨    18000
콜라     1000
맥주     5000
dtype: int64

In [4]:
type(sr) # 객체의 자료형

pandas.core.series.Series

In [5]:
#  데이터값만 추출
sr.values

array([17000, 18000,  1000,  5000], dtype=int64)

In [6]:
# 인덱스만 추출
sr.index

Index(['피자', '치킨', '콜라', '맥주'], dtype='object')

In [8]:
# 2차원 배열 : 데이터프레임(DataFrame)
# 행(index)와 열(column) 그리고 값(values)
values = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
index = ['one', 'two', 'three']
columns = ['A', 'B', 'C']
 #                   # index와 columns 자리 바뀌어도 상관X
df = pd.DataFrame(values, index = index, columns = columns)
df

       A  B  C
one    1  2  3
two    4  5  6
three  7  8  9

In [9]:
df.index

Index(['one', 'two', 'three'], dtype='object')

In [10]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [11]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]], dtype=int64)

In [12]:
# 데이터 프레임 : 리스트, 시리즈, 딕셔너리, 넘파이배열 등으로 생성
# 리스트를 이용한 데이터 프레임 생성
data = [
    ['1000', 'Steve', 90.72],
    ['1001', 'James', 78.09],
    ['1002', 'Doyeon', 98.53],
    ['1003', 'Jane', 64.19],
    ['1004', 'Pilwoong', 81.30],
    ['1005', 'Tony', 99.14]    
]

df = pd.DataFrame(data)
df

      0         1      2
0  1000     Steve  90.72
1  1001     James  78.09
2  1002    Doyeon  98.53
3  1003      Jane  64.19
4  1004  Pilwoong  81.30
5  1005      Tony  99.14

In [14]:
df = pd.DataFrame(data, columns = ['학번', '이름', '점수'])
df

     학번        이름     점수
0  1000     Steve  90.72
1  1001     James  78.09
2  1002    Doyeon  98.53
3  1003      Jane  64.19
4  1004  Pilwoong  81.30
5  1005      Tony  99.14

In [16]:
# 딕셔너리를 이용한 데이터프레임 생성
data = {
    '학번':['1000', '1001', '1002', '1003', '1004', '1005'],
    '이름':['aaa', 'bbb', 'ccc', 'ddd', 'eee', 'fff'],
    '점수':[90.72, 78.09, 98.43, 64.19, 81.30, 99.14]
}

df = pd.DataFrame(data)
df

     학번   이름     점수
0  1000  aaa  90.72
1  1001  bbb  78.09
2  1002  ccc  98.43
3  1003  ddd  64.19
4  1004  eee  81.30
5  1005  fff  99.14

In [17]:
# 데이터프레임 조회하는 작업
# df.head(n) : 데이터프레임의 앞에서 n개의 자료만 추출 # 일반적은 5개씩 출력
# head(df, n) : df 앞에서 데이터를 n개 가져와라
# df.tail(n) : 데이터프레임의 뒤부분에 n개의 자료만 추출
# df['열이름'] : 해당 열을 추출

In [21]:
df.head(3) # 앞에서 3개만 보겠다.
df.tail(3) # 뒤에서 3개만 보겠다.

     학번   이름     점수
3  1003  ddd  64.19
4  1004  eee  81.30
5  1005  fff  99.14

In [19]:
df['학번']

0    1000
1    1001
2    1002
3    1003
4    1004
5    1005
Name: 학번, dtype: object

In [22]:
# 학번과 이름만 추출
df[['학번', '이름']]

     학번   이름
0  1000  aaa
1  1001  bbb
2  1002  ccc
3  1003  ddd
4  1004  eee
5  1005  fff

In [26]:
# [행인덱스, 열인덱스] -> 이렇게 표현 해야함.
# df[1] # 1번째 인덱스, 키에러 -> loc, iloc 사용
df.loc[1]

학번     1001
이름      bbb
점수    78.09
Name: 1, dtype: object

In [27]:
# loc[행인덱스값, 열인덱스값], 라벨값 기반의 2차원 인덱싱
# df.loc[행인덱싱값] or df.loc[행인덱싱값, 열인덱싱값]
# iloc : 순서를 기반으로 정수 기반의 2차원 인덱싱

In [28]:
df = pd.DataFrame(np.arange(10, 22).reshape(3, 4), # 1차원 배열 -> 2차원 배열
                 index = ['a', 'b', 'c'],      # index값 하나 이상 -> []  묶기(팩터화)
                 columns = ['A', 'B', 'C', 'D']) 
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [29]:
# loc 인덱서를 사용할 때 하나의 값만 있다면 행을 선택
df.loc['a']

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [31]:
# df[['b', 'c']] -> 에러 dataframe에 직접 접근X -> 행과 열을 사용
df.loc['b':'c']

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [32]:
# df[행조건식, 열조건식]
df['b':'c']  # loc 사용X -> 추출 가능

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [33]:
df.loc[['b', 'c']] # 하나이상은 팩터로 묶는다 but, loc 빼고 팩터화하면 에러

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [34]:
df.A > 15

a    False
b    False
c     True
Name: A, dtype: bool

In [35]:
df.loc[df.A>15] # [조건식] -> boolean index

    A   B   C   D
c  18  19  20  21

In [36]:
def select_rows(df):
    return df.A > 15

In [37]:
select_rows(df) # 판정값 return

a    False
b    False
c     True
Name: A, dtype: bool

In [38]:
df.loc[select_rows(df)] # 값들을 return, loc는 행 인덱스를 받고 싶을 때.

    A   B   C   D
c  18  19  20  21

In [39]:
df.loc['A'] # 'A'는 열이기 때문에 행만 추출하는 loc로 하면 에러

KeyError: 'A'

In [40]:
df = pd.DataFrame(np.arange(10, 22).reshape(3, 4), # 1차원 배열 -> 2차원 배열
                 columns = ['A', 'B', 'C', 'D']) 
df

    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21

In [42]:
df.loc[1:2] # loc를 통해 1행에서 2행을 가져와라

    A   B   C   D
1  14  15  16  17
2  18  19  20  21

In [43]:
#df.loc[행, 열]
df.loc[1, 'A']

14

In [46]:
df.loc[1, :] # ':' -> 모든 열

A    14
B    15
C    16
D    17
Name: 1, dtype: int32

In [47]:
df.loc[1:, :]

    A   B   C   D
1  14  15  16  17
2  18  19  20  21

In [48]:
df.loc[[0, 1], ['B', 'D']] # 슬라이싱X, 팩터로 묶어서 가져올 수 있음

    B   D
0  11  13
1  15  17

In [49]:
df.loc[df.A>10, ['C', 'D']]

    C   D
1  16  17
2  20  21

In [50]:
df = pd.DataFrame({
    '체중':[80, 70, 65, 55, 52],
    '신장':[180, 177, 169, 190, 155],
    '성별':['남', '여', '남', '여', '남']
}
)
df # key값이 열 이름이 된다.

   체중   신장 성별
0  80  180  남
1  70  177  여
2  65  169  남
3  55  190  여
4  52  155  남

In [51]:
df['신장']

0    180
1    177
2    169
3    190
4    155
Name: 신장, dtype: int64

In [52]:
df[['체중', '신장']]

   체중   신장
0  80  180
1  70  177
2  65  169
3  55  190
4  52  155

In [53]:
df[df.성별 == '남']

   체중   신장 성별
0  80  180  남
2  65  169  남
4  52  155  남

In [54]:
df[df.성별 == '여']

   체중   신장 성별
1  70  177  여
3  55  190  여

In [83]:
data = {
    'name':['홍길동', '이순신', '장보고', '김유신', '강감찬'],
    'year':[2014, 2015, 2016, 2017, 2018], 
    'points':[1.5, 1.7, 3.6, 2.4, 2.9]
}

df = pd.DataFrame(data)
df

  name  year  points
0  홍길동  2014     1.5
1  이순신  2015     1.7
2  장보고  2016     3.6
3  김유신  2017     2.4
4  강감찬  2018     2.9

In [56]:
# 데이터 프레임의 정보 확인
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
name      5 non-null object
year      5 non-null int64
points    5 non-null float64
dtypes: float64(1), int64(1), object(1)
memory usage: 200.0+ bytes

In [57]:
# 수치형데이터 기초통계분석(기술통계분석)
df.describe() # 잘아야 한다.
# count -> 데이터 개수
# mean -> 평균값
# std -> 표준편차 값
# min -> 최소값

              year    points
count     5.000000  5.000000
mean   2016.000000  2.420000
std       1.581139  0.864292
min    2014.000000  1.500000
25%    2015.000000  1.700000
50%    2016.000000  2.400000
75%    2017.000000  2.900000
max    2018.000000  3.600000

In [59]:
# 데이터의 갯수를 세는 메서드 : count(), NaN (-> 비어있는 값) 값은 세지않는다.
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [60]:
s.count() # NaN은 count가 세지 않기 때문에

9

In [84]:
# 인덱스의 이름 변경
df.index.name = 'Nid'
# 열 인덱스의 이름 변경
df.columns.name = 'Info'
df

Info name  year  points
Nid
0     홍길동  2014     1.5
1     이순신  2015     1.7
2     장보고  2016     3.6
3     김유신  2017     2.4
4     강감찬  2018     2.9

In [85]:
# columns : 열이름을 목록으로 추출
# index : 행 인덱스의 목록을 추출
# NaN : Not a Number

dt2 = pd.DataFrame(data,
                  columns = ['year', 'names', 'points', 'penalty'],
                  index = ['one', 'two', 'three', 'four', 'five'])
dt2

       year names  points penalty
one    2014   NaN     1.5     NaN
two    2015   NaN     1.7     NaN
three  2016   NaN     3.6     NaN
four   2017   NaN     2.4     NaN
five   2018   NaN     2.9     NaN

In [86]:
dt2['year']

one      2014
two      2015
three    2016
four     2017
five     2018
Name: year, dtype: int64

In [87]:
dt2.year # direct 의  '.'을 사용할 때 팩터를 사용X

one      2014
two      2015
three    2016
four     2017
five     2018
Name: year, dtype: int64

In [88]:
dt2[['year', 'points']] # 2개 이상일 때 [[]] 사용

       year  points
one    2014     1.5
two    2015     1.7
three  2016     3.6
four   2017     2.4
five   2018     2.9

In [89]:
dt2['penalty'] = 0.7
dt2

       year names  points  penalty
one    2014   NaN     1.5      0.7
two    2015   NaN     1.7      0.7
three  2016   NaN     3.6      0.7
four   2017   NaN     2.4      0.7
five   2018   NaN     2.9      0.7

In [90]:
dt2['penalty'] = [0.5, 0.7, 0.9, 1.0, 0.6]
dt2

       year names  points  penalty
one    2014   NaN     1.5      0.5
two    2015   NaN     1.7      0.7
three  2016   NaN     3.6      0.9
four   2017   NaN     2.4      1.0
five   2018   NaN     2.9      0.6

In [91]:
# 새로운 columns 생성
dt2['ages'] = np.arange(10, 15)
dt2

       year names  points  penalty  ages
one    2014   NaN     1.5      0.5    10
two    2015   NaN     1.7      0.7    11
three  2016   NaN     3.6      0.9    12
four   2017   NaN     2.4      1.0    13
five   2018   NaN     2.9      0.6    14

In [92]:
del dt2['ages']
dt2

       year names  points  penalty
one    2014   NaN     1.5      0.5
two    2015   NaN     1.7      0.7
three  2016   NaN     3.6      0.9
four   2017   NaN     2.4      1.0
five   2018   NaN     2.9      0.6

In [93]:
# [start:end-1]
dt2[0:3] # 인덱스값 슬라이싱

       year names  points  penalty
one    2014   NaN     1.5      0.5
two    2015   NaN     1.7      0.7
three  2016   NaN     3.6      0.9

In [95]:
dt2.loc['two'] # -> 라벨링 되어 있는 것을 가져올 때는 loc를 사용해야 함.

year       2015
names       NaN
points      1.7
penalty     0.7
Name: two, dtype: object

In [96]:
dt2.loc['two':'four'] # 숫자로는 end -1 이지만 문자는 끝도 포함해서 가져옴.

       year names  points  penalty
two    2015   NaN     1.7      0.7
three  2016   NaN     3.6      0.9
four   2017   NaN     2.4      1.0

In [97]:
# loc[행범위, 열범위]
# 범위 => start:end, :(all)
dt2.loc[:,['year', 'names']] # [:,] -> 행 다 가져오기

       year names
one    2014   NaN
two    2015   NaN
three  2016   NaN
four   2017   NaN
five   2018   NaN

In [100]:
# iloc() : 숫자 인덱스를 이용
dt2.iloc[3] # 숫자 인덱스를 사용하고 싶을 때 iloc()를 사용.

year       2017
names       NaN
points      2.4
penalty       1
Name: four, dtype: object

In [101]:
# 라벨링 되어 있는 것 이용 : loc()
# 숫자 인덱스를 사용 할 때 : iloc()
dt2.loc['four']

year       2017
names       NaN
points      2.4
penalty       1
Name: four, dtype: object

In [102]:
# iloc[행범위, 열범위]
df.iloc[3:5, 0:2]

Info name  year
Nid
3     김유신  2017
4     강감찬  2018

In [103]:
dt2.iloc[:, 1:4]

      names  points  penalty
one     NaN     1.5      0.5
two     NaN     1.7      0.7
three   NaN     3.6      0.9
four    NaN     2.4      1.0
five    NaN     2.9      0.6

In [106]:
dt2.iloc[1, 2]

1.7

In [107]:
dt2

       year names  points  penalty
one    2014   NaN     1.5      0.5
two    2015   NaN     1.7      0.7
three  2016   NaN     3.6      0.9
four   2017   NaN     2.4      1.0
five   2018   NaN     2.9      0.6

In [108]:
dt2['year'] > 2016

one      False
two      False
three    False
four      True
five      True
Name: year, dtype: bool

In [109]:
dt2.loc[dt2['year'] > 2016, :]

      year names  points  penalty
four  2017   NaN     2.4      1.0
five  2018   NaN     2.9      0.6

In [111]:
# 6 x 4
df = pd.DataFrame(np.random.randn(6, 4))
df

          0         1         2         3
0 -0.706894  0.004597  0.989364  1.216113
1  0.608659  0.287727 -0.135649  0.980353
2  2.127531 -0.971143 -1.638921  1.002718
3  0.752846 -1.151520 -0.668336 -0.468643
4 -0.859178  0.855406  1.253164  1.722852
5 -1.151973 -0.688930 -1.082728 -1.465858

In [112]:
# 생성된 데이터프레임에 열인덱스와 행인덱스 값
df.columns = ['A', 'B', 'C', 'D']
# date_range('시작날짜', 옵션)
df.index = pd.date_range('20210419', periods = 6) # period 날짜 구분(6개)
df

                   A         B         C         D
2021-04-19 -0.706894  0.004597  0.989364  1.216113
2021-04-20  0.608659  0.287727 -0.135649  0.980353
2021-04-21  2.127531 -0.971143 -1.638921  1.002718
2021-04-22  0.752846 -1.151520 -0.668336 -0.468643
2021-04-23 -0.859178  0.855406  1.253164  1.722852
2021-04-24 -1.151973 -0.688930 -1.082728 -1.465858

In [114]:
# D 컬럼을 삭제하는 작업
df.drop('D', axis = 1) # 넘파이랑 반대 -> axis = 1 : 행, axis = 0 : 열 
                      # pandas -> axis = 0 : 행, axis = 1 : 열
                      # dataframe에 저장X -> df 출력하면 원상태 그대로 출력

                   A         B         C
2021-04-19 -0.706894  0.004597  0.989364
2021-04-20  0.608659  0.287727 -0.135649
2021-04-21  2.127531 -0.971143 -1.638921
2021-04-22  0.752846 -1.151520 -0.668336
2021-04-23 -0.859178  0.855406  1.253164
2021-04-24 -1.151973 -0.688930 -1.082728

In [115]:
# B, C 컬럽 삭제
df.drop(['B', 'C'], axis = 1)

                   A         D
2021-04-19 -0.706894  1.216113
2021-04-20  0.608659  0.980353
2021-04-21  2.127531  1.002718
2021-04-22  0.752846 -0.468643
2021-04-23 -0.859178  1.722852
2021-04-24 -1.151973 -1.465858

In [116]:
df = pd.DataFrame({
    'weight':[80, 70.4, 65.5, 45.9, 52.2],
    'height':[170, 180, 155, 143, 154]
})
df

   weight  height
0    80.0     170
1    70.4     180
2    65.5     155
3    45.9     143
4    52.2     154

In [117]:
# 세로방향으로 합계를 구하는 작업, 컬럽별 합계
#df.sum() # 이렇게 하면 모든게 다 더 해짐
df.sum(axis = 0)

weight    314.0
height    802.0
dtype: float64

In [118]:
# 가로방향의 합계(각 행의 합계)
df.sum(axis = 1)

0    250.0
1    250.4
2    220.5
3    188.9
4    206.2
dtype: float64

In [119]:
# 신장의 평균값
df['height'].mean()

160.4

In [120]:
# 체중의 평균
df['weight'].mean()

62.8

In [121]:
# 분산
df['height'].var()

212.3

In [122]:
# value_counts : 각각의 값의 출현빈도수를 계산하는 메서드
s = pd.Series(np.random.randint(6, size = 100)) # 0 ~ 5사이 수 100개
s.tail() # n개 안해주면 뒤에서 5개 수를 보여줌

95    1
96    2
97    0
98    3
99    3
dtype: int32

In [123]:
s.value_counts() # 많이 사용.

1    25
3    22
2    17
0    16
5    13
4     7
dtype: int64

In [127]:
# 데이터 정렬 : sort_index와 sort_values
# sort_index : 인덱스를 기준
# sort_values : 데이터 값을 기준
# 내림차순 : ascending = False
# by : 열 (정렬 기준이 되는 열을 지정할 때 사용)
s.value_counts().sort_index() # 0 1 2 3 4 순서대로 정렬

0    16
1    25
2    17
3    22
4     7
5    13
dtype: int64

In [128]:
s.value_counts().sort_values(ascending = False)

1    25
3    22
2    17
0    16
5    13
4     7
dtype: int64

In [129]:
df

   weight  height
0    80.0     170
1    70.4     180
2    65.5     155
3    45.9     143
4    52.2     154

In [131]:
# 체중을 이용해서 정렬
df.sort_values( by='weight', ascending = False)

   weight  height
0    80.0     170
1    70.4     180
2    65.5     155
4    52.2     154
3    45.9     143

In [134]:
# 행/열 합계
# sum(axis), 1 : (행방향, 가로), 0 : (열방향, 세로)
df2 = pd.DataFrame(np.random.randint(10, size=(4, 8)))
df2

   0  1  2  3  4  5  6  7
0  2  7  1  0  0  7  1  2
1  0  8  8  5  2  3  2  0
2  7  9  6  1  5  5  3  0
3  5  4  6  5  8  4  0  9

In [135]:
# 행방향 합계
df2.sum(axis=1)

0    20
1    28
2    36
3    41
dtype: int64

In [136]:
df2['RowSum'] = df2.sum(axis = 1)
df2

   0  1  2  3  4  5  6  7  RowSum
0  2  7  1  0  0  7  1  2      20
1  0  8  8  5  2  3  2  0      28
2  7  9  6  1  5  5  3  0      36
3  5  4  6  5  8  4  0  9      41

In [137]:
df2.sum() # axis = 0은 생략가능, default

0          14
1          28
2          21
3          11
4          15
5          19
6           6
7          11
RowSum    125
dtype: int64

In [139]:
df2.loc['ColSum'] = df2.sum()
df2

         0   1   2   3   4   5   6   7  RowSum
0        2   7   1   0   0   7   1   2      20
1        0   8   8   5   2   3   2   0      28
2        7   9   6   1   5   5   3   0      36
3        5   4   6   5   8   4   0   9      41
ColSum  28  56  42  22  30  38  12  22     250

In [140]:
# apply() :  행과 열을 반복해서 특정 함수를 이용해 작업할 때 
df3 = pd.DataFrame({
    'A':[1, 3, 4, 3, 4],
    'B':[2, 3, 1, 2, 3],
    'C':[1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [141]:
# 각 컬럼별 최대값에서 최소값의 차이를 구하는 작업
# lambda x(출력값) : x.max() - x.min() (입력값)
df3.apply(lambda x : x.max() - x.min())

A    3
B    2
C    4
dtype: int64

In [146]:
# 각 행별 최대값에서 최소값의 차이를 구하는 작업
func = lambda x : x.max() - x.min()
df3.apply(func, axis = 1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [143]:
# value_counts
# 각 열에 어떤 값이 얼마나 사용되었는지 알고 싶다면
df3.apply(pd.value_counts) # 열 방향

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [144]:
# 데이터 정제 : 결측치나 이상치
# NaN(결칙값) => fillna(value)
df3.apply(pd.value_counts).fillna(0.0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [145]:
# is~
# as~ : 변환, astype() -> ()에 있는 것으로 자료형 형변환.
df3.apply(pd.value_counts).fillna(0.0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

In [147]:
# 매직명령어(magic)
%%writefile sample1.csv
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

UsageError: Line magic function `%%writefile` not found.

In [148]:
# csv 읽어오기
df4 = pd.read_csv('sample1.csv')
df4

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [150]:
df5 = pd.read_csv('sample2.csv', header = None) 
df5                  # c1, c2, c3 제거 했을 경우 머리끈 없다고 선언

   0     1       2
0  1  1.11     one
1  2  2.22     two
2  3  3.33   three

In [152]:
df6 = pd.read_csv('sample2.csv', names = ['c1', 'c2', 'c3']) # 열 머리끈 생성 
df6

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three